Revit 2027 API
Mesh.DistributionOfNormals Property
 Indicates the distribution of normal vectors along the tessellated mesh surface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DistributionOfNormals DistributionOfNormals { get; }
Public ReadOnly Property DistributionOfNormals As DistributionOfNormals
	Get
public:
property DistributionOfNormals DistributionOfNormals {
	DistributionOfNormals get ();
}
member DistributionOfNormals : DistributionOfNormals with get
Property Value
DistributionOfNormals
See Also
Reference
Mesh Class
Autodesk.Revit.DB Namespace